{"intents": [
    {"tag": "greetings",
      "patterns": ["hello", "hey","hi","good day","Greetings","what's up","how is it going"],
      "responses": ["Hello!", "Hey!", "What can I do for you?"]},
    {"tag": "goodbye",
      "patterns": ["See ya", "see you later","bye","goodbye","have a nice day","bye bye"],
      "responses": ["Goodbye!", "See you later.", "Please come back soon."]},
    {"tag": "weather",
      "patterns": ["Are there other climate consideration for rentals?", "How does the weather affect the rental properties?"],
      "responses": ["In the winter, you need to make sure that the rental property has good insulation, especially around the windows and vents. Heating can cost a lot if there are gaps."]},
    {"tag": "travel",
      "patterns": ["What is the best way to travel in the city?", "How quickly can I get around?"],
      "responses": ["Taxi or bus", "The buses are usually reliable, but you should leave 30 minutes earlier to be safe. You can also take a taxi, but it might be expensive."]},
    {"tag": "cost",
      "patterns": ["What are the different types of utilities that renters have to pay for?", "What kinds of utilities are included in the renter's expenses?","Utilities for renters: what are the different types?"],
      "responses": ["Gas, electricity, water, internet, TV license, and council tax are utilities that renters have to pay for.", "Utilities for renters include gas, electricity, water, internet, TV license, and council tax.", "Renters pay for utilities such as gas, electricity, water, internet, TV license, and council tax."]},
    {"tag": "utility",
      "patterns": ["How much do you have to pay for utilities when renting a property?", "What are the utility costs for renting a property?","How much are the utilities for a rental property?","What is the monthly utility bill for renting a property?"],
      "responses": ["Utilities include gas, electricity, water, internet, TV license, and council tax.", "Gas, electricity, water, internet, TV license, and council tax are utilities.", "Utilities are the services that you use and pay for, such as gas, electricity, water, internet, TV license, and council tax"]},
    {"tag": "bookings",
      "patterns": ["What are the different kinds of accommodation available?",
        "What are the various accommodation choices?"],
      "responses": ["This depends on your budget", "hotels, B&Bs, guesthouses, apartments, and self-catering",""]}
  ]}